Revit 2026 API

# LinePatternElementSetLinePattern Method

---

Sets the LinePattern associated to this element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLinePattern(
	LinePattern newLinePattern
)
```
```vb
Public Sub SetLinePattern (
	newLinePattern As LinePattern
)
```
```cpp
public:
void SetLinePattern(
	LinePattern^ newLinePattern
)
```
```fsharp
member SetLinePattern :
        newLinePattern : LinePattern -> unit
```

#### Parameters

newLinePattern LinePattern
     The new LinePattern object.

| Exception | Condition |
| --- | --- |
| ArgumentException | The Line Pattern is not valid. |
| ArgumentNullException | A non-optional argument was null |

The data stored inside the input LinePattern will be copied into this element. The input LinePattern itself will not be associated with the element.

#### Reference

LinePatternElement Class

Autodesk.Revit.DB Namespace